<?php
header('Content-Type: text/html; charset=utf-8');
if (isset($_GET['text'])) {
    echo strtr($_GET['text'], ['kh' => 'خ', 'o' => 'و', 'v' => 'و', 'b' => 'ب', 'y' => 'ی', 'i' => 'ی', 's' => 'س', 'a' => 'ا', 'l' => 'ل', 'm' => 'م', 'd' => 'د', 't' => 'ت','gh' => 'ق', 'ghe' => 'غ', 'he' => 'ح', 'te' => 'ط', 'j' => 'ج', 'n' => 'ن', 'see' => 'ص', 'r' => 'ر', 'ze' => 'ظ', 'zee' => 'ذ', 'zz' => 'ض', 'ss' => 'ث', 'zhe' => 'ژ', 'ch' => 'چ', 'c' => 'ک', 'h' => 'ه', 'z' => 'ز', 'f' => 'ف', 'p' => 'پ', 'k' => 'ک', 'sh' => 'ش', 'g' => 'گ', 'e' => '', 'ea' => 'ع']);
}
?>